[
    "Yes, it can be blocked 🎵",
    "Nah same dude",
    "Banning tiktok is absolutely not a violation of the first amendment because it has nothing to do with free speech. Other social media platforms exist, right? It's about our privacy and security.",
    "How did you learn to count the seconds?",
    "Hopefully it is banned. It's Chinese based and has been selling users information to the Chinese government. If your argument is \"how will I make a living if TikTok gets banned\"... You need a life",
    "Tbh I don't like the US government having my personal data either. \n\nAll of this needs to be banned. But it won't happen. I don't care about China, the US or any other country. This is Earth and I care about humanity as a whole. \n\nI'm tired of a small few controlling the mass majority.",
    "Ban TikTok in Texas, please?",
    "Why Does Hate TikTok So Much?",
    "How in the world does this not even have 1 million views? Either way, it's best for it be banned if we're going to get more reports about personal data and ruining young generations.",
    "Tik tok needs to be banned. It's conditioning the youth by the masses for future manipulation and control.",
    "I wish TikTok need to Shut down like for reals 😒👎🏼\nThey have to",
    "I hope they ban it from the entire wolrd.",
    "I am suprised that soon I uninstalled tiktok when it was 2020 (India) when I came from my farm to my home❤",
    "Ban tiktok before its to late",
    "if tiktok wouldn't have existed, by now we would have flying cars.",
    "Tiktok bombards users with pro-CCP propaganda. It should definitely be banned.",
    "Please ban tiktok, it’s gone on for long enough",
    "There is literally people who deleted tiktok and went “phew, now my personal information is safe and not being shared…” 😂😂😂😂",
    "Good because it’s a biggest risk and it’s ruining society. So who ever tried to take this app down I’m gotta give them a lot’s of respect for that 😎",
    "Clapper is alot worst!",
    "China USA war is far from being over",
    "Yes!!!! Please if it does get banned. Praise Jesus ❤",
    "Please please please yes!! Maybe people will relearn how to make eye contact and talk to real people. Maybe even do something in life that TikTok didn't tell them to do. 🎉🎉🎉🎉",
    "Hopefully",
    "I have never used it because i know that everything from the PRC is suspicious, but i have underestimated its impact on the society",
    "Thank You NBC",
    "You can still use YouTube and Instagram.",
    "Yes I’m so happy for tik tok right now by bye",
    "Typical American arrogance, they want to ban tiktok but won't ban guns that kills hundreds of thousands including children. Where's your priorities?",
    "I am Indian and I am glad that our government banned TikTok for good",
    "This is ridiculous. America is not a communist country. Banning Tik Tok is a real communist thing to do.",
    "Let’s be real, US would be a better place if TikTok was banned.",
    "Ban the stupid app",
    "Now Tiktok is Illegal in Ohio",
    "wow in 30?days",
    "Finally is getting banned!",
    "TIKTOK is brainwashing our children.  The other day i saw 3 little boys playing dress up with make up.  I asked them why are they doing it and they replied \"we watched it on tiktok\".",
    "YES",
    "Tiktok is no more harmful that suckeerburgs Fakebook.",
    "I want it gone.",
    "Americans, you think you have the control of your govt.  No... your govt has tighter and tighter controls over you!",
    "In China, people can freely choose Apple phones or Huawai phones, people can freely support RU or Ukraine.  In America, people can freely ... buy weed and guns.",
    "Wow, I didn't know the geography location of U.S.A is a secret.  Must ban all the maps and globes as well.",
    "I love to how I immediately get a tik tok ad after the video LMAO",
    "Aye while your at it, ban onlyfans (but after when Markiplier is done raising Charity funds tho)",
    "I guess there really is a God",
    "USA trying to \"HUAWEI\" TIK TOK",
    "Let’s have a 30 day social media cleanse and see what happens 😄",
    "Yep, TikTok for making a Dangerous trends and people were being STUPID and DIED cause of the dangerous challenge such as Benadryl Challenge, Blackout Challenge or other dangerous challenge",
    "Let’s goooo",
    "honestly.....actually US can ban any social media they want without much hoo ha just like China always does. Why do politicians have to make a fool of themselves? Is it because this is what US-style democracy dictates? All these social media apps are economic products which a country can accept or reject for the local consumption - why is there a need to rationalise? And to rationalise on the world-wide stage, at that.\n\nAlso, basically, tiktok is doing what its predecessors like instagram, facebook, google, etc has always done. However, for greater assurance, tiktok has even situated their source codes, algorithms, physical buildings right inside US to be used by US-manned agencies on US' land by American citizens: why all these nonsense about security concerns? Isn't the US grateful about how the economy has been opened through the use of tiktok, especially its help during the pandemic?\n\r\nBtw, did US ask for permission when they bomb Iraq, or for their involvement in military coups, acts of terrorism and genocides in other parts of the world? Be brutally honest - US fear that US citizens are getting to know more about political lies and terrorist acts in other countries, the deaths of young citizens abroad fighting other people's wars and waste of taxpayer's money and resources. But then, the floodgate is already raised and the Pandora Box opened long time ago......\r\n\r\nI really don't understand politics: US-styled",
    "Ban the Chinese TikTok",
    "Snapchat does the same thing",
    "Y’all know this is not just about tik tok right??",
    "Here I might have a solution. Make an American version of TikTok, where policies are determined by a state by state basis, and the proceeds of advertisement remain the same. ByteDance will receive their usual income via advertisement, the users receive their cut if the revenue, and policies will be reviewed and maintained by U.S. officials. This includes the prevention of possible foreign malware. It's a win-win solution. Data will be sold if desired by the user to an American partner of the Chinese owned company. The American company will act as sort of an \"embassador\" to the parent company ByteDance, and shall respond to the requests of the U.S government and fulfill all requirements needed.",
    "Honestly, this really isn’t that bad if you think about it. TikTok is the origin of so many dramas and harmful things, in which is really bad because there are young children on the app. Based off of experience-",
    "Wake up this isn’t just about TikTok it’s crazy how most of y’all don’t research anything before you speak. You can say bye 👋 ✌️ to your privacy if this passes.",
    "Name , Email address, and location.... do u mean facebook, Youtube and Twitter?",
    "Ban the *WE//AP//ONS*",
    "I hope tik tok gets deleted",
    "oh my god i dont need no presents for my birthday this is PERFECT",
    "We have to ban tik tok. Tik tok is toxic",
    "there is no other app like tiktok. if they ban it, i feel like minorities like small businesses and cosplayers will have nowhere else quite as good to go.",
    "*laughs in VPNs*",
    "Ban all social media. People communicating with each other is dangerous! The politicians could care less about banks and the middle class failing but they don’t want Winnie to watch teenagers dance!😏",
    "Finally USA doing something with China tech",
    "I wonder how the hype house and those sisters from tik tok are taking all this",
    "Ban it!",
    "I never used TikTok.  TikTok should be banned completely.  Safety to our national security!!!!",
    "Lets hope it gets banned",
    "If y’all want tiktok banned because it holds your info, might as well ban instagram, facebook, all shopping apps, and youtube because our info is already out there regardless, y’all must be dumb if you think banning tiktok is gonna stop it",
    "FB lost competition so it lobbied US government & congress to ban it.",
    "Sucks to be Timmy ten. XD",
    "Ban this app! It brings nothing but depression and suicides to our youth.",
    "Honestly, I don’t care. I don’t use TikTok anyways since I’m not that popular than I minimally am on YouTube. If anything, TikTok is making Gen Z’s more and more idiotic. I think it’d be better off.",
    "Like the other apps, don’t do that.  Just because China could do it to advertise to us like Facebook is doing. This is about controlling generation Z. It’s after generation Z if they are going to allow it.",
    "it already is deleted😊",
    "Ban that terrible app please 😂",
    "Can you get bigo live band ＼⁠(⁠°⁠o⁠°⁠)⁠／",
    "Oh that would be awesome I hate TikTok it's garbage",
    "It shouldn’t be banned purely because it allows normal people to identify all the crazy narcissists to avoid.",
    "Ban TikTok for good",
    "Bye Biden we won’t be limited",
    "remove it forever",
    "Biden to the rescue!   Please protect our country!",
    "A country that claims to be free and democratic has banned a social software because it poisons freedom, and you make countries that are not free and undemocratic like China😂😂",
    "As a gen z it should be banned",
    "Finally! Something good about to happen haha",
    "I'm irritated because TikTok would NOT have such a huge influence and hold on U.S. users, like YouTube (and others), if they would give its users more power to promote their content.",
    "I think everyone who comments in approval to ban must be over 60. Y’all sound dumb. It reminds me of my grandma complaining about me listening to that devil music.",
    "Uhm you mean like google,facebook, YouTube 😂😂😂😂 this is still their argument.",
    "Government: Ban assault weapons now!\nKids today: \"🎉😊❤️👍\"\nGovernment: \"Ban tiktok now!\"\nKids today: \"😯😡🤬 constitution this free speech that. Nazis can't win\"\n\nThis is unreal 😂",
    "I agree that Tik Tok is a danger to other countries'  Nat'l Security (per annual update of U.S. security threats). After all, China can turn users' cameras &/or microphones &/or location info on, gather contacts' info & \"visit\" their cell phones, install software, get passwords, all without anybody's consent or even awareness, Etc., Etc.. \n  Even though hacking occurs through other means too (by China and countless others), that's not justification to keep this app in the U.S.. \n   Other data mining & phone manipulation needs to be continuously  fought too (incl by educating individuals re ways to limit their data vulnerabilities), incl by Congress! \n   All websites & apps can be mandated by laws (as many other countries have passed) to disclose who their data is shared with (& who those they share with share with ... all the way up, laterally, and throughout all directions in the chain),\n plus\nlet users \"opt out\"/turn off \npermissions (whose defaults should start out as  \"off\", not \"on\") via one pop-up window with switches on it ... without  requiring opening additional links! \n   Phones can be programmed to trace the history of where websites originated, and if anywhere along its route included any countries without adequate data protection then that website could be banned ... or at least pop-up an advisory for the viewer to cancel it BEFORE contact is established. Malicious sites would predictably seek work-arounds, but at least cyber-crime investigators would have a less daunting task in trying to stop them then if we just give up even trying. \n   In country software developers can easily, and more securely, offer similar services to former Tik Tok users. We shouldn't exaggerate any \"suffering\" current users may face. Not helpful!  \n  Advertisers do pay platforms more for targeted ads, but advertisers should have to go  back to what t.v. and printed media advertisers have been doing for decades, which is to figure out what sites their target market is most likely to see. \n   The internet is here to stay, and advertisers will have to pay whatever platforms need them to for sustainability. Defending privacy won't make platforms or advertisers suffer nearly as much as their policies are making users (& our country via too-easily  precision targeted propaganda) suffer now.",
    "fun fact: I'm a 15 year old who has never used tiktok. I know the affects it will have on me later in life.\nEdit: I'm also a straight a student and choose to hangout w friends and go out rather then scroll my phone consistently.",
    "Just do it now. The app has been a troublemaker for idiots to leak info to our land but also showing idiot's true color and leaking info to track US weakness.",
    "The US government wants to ban TT because they platform provides a lot of useful information about the government it does not like. It has nothing to do with stealing data.  Google , Facebook, etc steals WAY MORE data than TT.",
    "This would be the best thing ever if this was banned.",
    "Tiktok realized it had data mining gold on its hands with its algorithm and constant video feed. Once it ate into the ad share of the other social media platforms, we saw all of them create similar platforms; YouTube shorts, Instagram shorts, Facebook shorts. The longer they can keep your attention the more ad dollars they can rake in for their shareholders. My wife works for a Hypersonic jet company that's backed by the US Military and other defense contractors. None of their employees are allowed to have tick tock because of the data mining software in the background. They should have gotten rid of this app under Trump. It's completely detrimental to our society and our security.",
    "It seems the terms are Chinese owners need to sell their shares, or it will be banned. It would be great if someone like Ryan Reynolds called their bluff and bought it while maintaining the original staff.",
    "Tiktok is like brain damage for society, if its gone, I doubt most would care.",
    "Yes thank god. PLEASE. I’m sick of grown men doing feminine dancing.",
    "Instagram is better than tiktok",
    "First and foremost, i dont use tiktok or social media much. Our social media companies couldn't compete with Tiktok.  So we came up with some bs about a national security concern. Now we 're demanding  a foreign company be sold to us or face a ban. Does that make sense to anyone? Let's think about this logically? Had the Chinese done this to us, we would have given them the fingers.  I love our country, but something has gone very wrong within the last several years.",
    "Ban it",
    "zoomer meltdown incoming...",
    "If someone buys a knife and stabs someone or commits suicide, we want to ban knives, which is a very stupid idea.",
    "It can be used in China, as long as fb and yt have their data centers in China, and uploaded content will be approved.  It's as simple as that. Tiktok is banned now because the United States has not dealt with content approval.  It just doesn't take the government's responsibility seriously.",
    "Yup it will. Tiktok had a chance in the past to change but its still very bad.  People promote half naked or naked kids and babies on the app taking showers or bubble baths . They use fake engagement and it promotes terrorism they expose these children to pedophiles... and promote child kidnapping or child being sexually abused.  THERES TON OF CASES THAT HAPPEN THOUSAND OF STORIES LIKE THIS ON THE APP. People don't want it banned because they make money from their kid videos so they all use their children for money on the app videos and livestreams.",
    "where do I sign up to ban tik tok? can't wait to get rid of that poison",
    "Please please ban it",
    "Tik tok is the definition of a simulation,fake af",
    "But...but... I thought this was just a MAGA conspiracy? It was made up by the evil Orange Man!",
    "Can we banned Google there are from Israel  I am scared my information to go over there wtf  republicans this fooo",
    "Facebook is no better with your data and personal information",
    "It's way to many people doing crazy and dumb stuff spreading lies about people especially in gyms  yea it needs to be banned",
    "This is the result of millions of multi-media production devices in the hands of those who have absolutely zero talent and very low intelligence...",
    "Yeah, so worried about Russia and China spying on us, But not at all worried about usa apps browsers corps gov spying on you, stealing data, mining your info, removing your comments, stealing your freedom, watching you, etc. Hypocrisy is huge .  Oh yeah, focus on other countries instead of the one you live in doing far worse in terms of spying on you.",
    "Ban it now!",
    "00:30 yes we can CLEARLY see you are 18 lol. And that you don’t know anything.",
    "PLEASE DO IT!!!",
    "Bann TikTok",
    "but have you tried my favorite app grindr?",
    "I heard that America is a democracy.  America is a free country.  America is a great country.  with tiktok just scared.  What a pity.  tik tok phobia",
    "I haven't used tiktok in about 5 months. Deleted it since it took up all my storage. \n\nWill I miss it if it does get banned? Yes, a little. But, will I survive? Absolutely. Sure it'll be a bit disappointing, but i went 13 years of my life without tiktok perfectly fine. I think i'll be okay 😂",
    "Oh god, please do ban Tik Tok . It will be the greatest thing to ever happen to anyone.",
    "Tik Tok is anti-American, they promote immoral and illegal behavior and I have seen video upon video of videos denouncing democracy for the sake of communism pushed through that algorithm.",
    "It's not about personal data is about politics",
    "ANOTHER thing Trump was 100% correct about.",
    "Wouldn't be much of a lose, this got the teens hooked up to dangerous and toxic stuff and communities.",
    "It’s censorship it violates first amendment",
    "Why is it on governmental devices to begin with?",
    "Hopefully vine could come back",
    "Tik tok needs banned it violates the rights of men let’s woman do what they want say what they want and act what they want what’s is that my American that’s discrimination to men. Not only that letting lady’s get on tik tok and expose there self tik tok itself has violated its own guidelines more than I can count",
    "One thing I know is, that,  there is one big juggernaut that hates tik tok. And not because of security risks. It’s because tik tok is taking away revenue from another juggernaut. Just find out who or what outfit stands to gain most from tik tok out of the picture? Then you’ll see the outfit putting pressure on legislation to ban tik tok.",
    "I think government schools should be banned. Forced education sounds a lot like Nazi Germany. You know... socialists.",
    "USA sucks",
    "Please ban it!",
    "THANK GOODNESSS FINALLY",
    "YES! Delete TIK TOK!!! Say NO to Spying China!",
    "#NBCnews Tik Tok has largely let me have my FREE SPEECH..Tik Tok is a platform that also Represents FREE SPEECH. The USA Congress is trying to Violate FREE SPEECH by baning Tik Tok..da USA Congress is infiltrated by Communist Lenin ideologies which \"burns the books\" like a bunch of nazi's..ironically they point the finger at China but believe the same Lenin philosophy..Tik Tok, Let Women Wear bikini's, Dresses + Tops on LIVE Shows without Fear of being deleted because their nipples show thru..NO SEXISM.",
    "🤣🤣🤣🤣🤣My god this needs to happen and hopefully every mentally ill tik tok wannabe celebrity moves out of the country too",
    "All the cringe TikTok culture, the dances, songs you like but getting ruined on tiktok, the NPC culture, the exact same videos and trends repeating over and over again especially those cringe edits, the MrBeast wannabes, people who do the most basic and most unoriginal skits possible but still getting millions of followers because \"they look good\", the people doing anything to get 5 seconds of clout and attention online just for most people to scroll and never see them again... They finally might go for good",
    "I hope so. My generation has been screwed by TikTok and a Chinese company being in charge while taking personal info is not okay.",
    "The ignorance and lack of insightfulness among these teens and other TikTok users demonstrate how powerful and corrupt this social media app has. Looking forward to banning this app. The majority of teens in my High School use this app and up till this day I don't get the appeal to waste your time scrolling mindlessly like a zombie. Such a shame how my generation become.",
    "Use yt shorts. Solution is always there why bark?",
    "Yes tok tik needs to be deleted because so many people are getting threats and so many people have killed they self over this app. It needs to be deleted. People can be all in a feelings all they want they will be able to have Facebook Instagram I guess I see it but TikTok yeah it need to be deleted.",
    "Operating in the United States, data is stored in the United States and under supervision. What data does China need from you? Do you think they are as happy about stealing data as the United States? The real reason is the backwardness of American Internet companies\n\n \n笔记",
    "What does an 18 year old know about national security. China bans it there, no problem here though???",
    "Omg its not like facebook has been doing that for years. How many times has facebook been hacked again. Too many to count?",
    "Never install or use tiktok, but talking about tiktok get and use your data ? Well.. who doesn't ? FB is the worst since they even asking for ID card photo.",
    "Lol no different from Facebook and google or what ever else. 😂 they’re mad fb, insta, exc has no business and TikTok is taking it away. America is becoming fkn wack. We ain’t free!! 😂😂 might as well vote a dictator inn already! 🤡s",
    "i really hope it gets banned its making my generation a living nightmare and has ruining my mental health i cant go one day at school without seeing someone watch something offensive, racist, homophobic or dangerous",
    "Are Americans really that stupid? The Chinese Communist Party can ban the US apps in China, why the US can't ban CCP apps?",
    "Young Americans who don’t care about their data being accessible to China will soon learn and cry 😂 y’all are doomed over there with your young generation",
    "Ban it",
    "I think they should ban it because at one point I had to 113000 followers on itap and they banned me for no reason and there's they like to promote sin and if you're mentioned God all they banned you for life!",
    "Only good thing biden has done tbh",
    "W ban",
    "what where gunna censor people now, you know who that sounds like",
    "So you’re saying now US should learn from China and be just like the communist？",
    "Many reports have shown Tik-Tok is run by the Chinese government, which in fact is the Chinese Communist party and they use it to spread misinformation and distrust among the American people",
    "And quit removing posts",
    "I deleted it for this reason",
    "Yes please",
    "Ban it please",
    "Bloody well hope so. My life would be totally fine if all social media was erased",
    "The ONLY reason the government would ban Tik Tok is because they can't control it. Tik Tok exposes so much corruption and actual news and THATS what they hate. A platform they can't control.🖕",
    "TikTok is banned in china you don't have to be a university graduate to see that China is spying.",
    "My generation might be saved!",
    "Unlike other social media companies, TikTok should be banned. It is a CCP machine. It was originally musically and rebranded.",
    "PLEASE let this happen",
    "OMG CHINA IS GETTING CRITICAL INFORMATION ABOUT THE UNITED STATES FROM TIK TOK IN THE FORM OF...dancing girls...",
    "China even banned TikTok lol",
    "Wow! Millennials are so stupid! Like \"Free speech\" has anything to do with data harvesting! Even though all the American companies ALSO harvest your data! How about you exercise your free speech out in the real world, where it actually MATTERS...",
    "If the US is worried that tiktok is used for spying, that makes me question the social media platforms in the US. You wouldn't think that unless you were guilty of it yourself.",
    "We are talking about National Security here folks.",
    "Plz ban tik tok all over USA...",
    "I hate tiktok its the worst social media app ever created it's horrible I hope they ban it for good im tired of hearing about it",
    "I want it banned for different reasons. I suspect the COO is telling the truth that the vast majority of that data is not in China's possession. I suspect the CPC has asked and been given access to others' data outside the US though. My reason for wanting it banned is the detrimental affect it has on society. The vast majority of the videos are ridiculous time wasters and the most sought after occupation in America now is influencer which is stupid. TikTok makes America dumber. That's the purpose that China uses it for. They're not mining American data. They're dumbing America down and meanwhile TikTok is banned in China. The version they permit to their people is like vegetables for the brain. Tons of educational content that makes kids want to be astronauts and scientists. The YouTube channel Moon does a good job explaining it here: https://youtu.be/q6XovIL0jAY",
    "India did it before it was cool 😒",
    "People are already pooping in Instagram Reels then whats the need of tiktok Chinese Sh*t ?",
    "Bye tiktok never cared",
    "Save us from cringe",
    "Oh no",
    "A gift from my tiktok to your azimuth",
    "Clicks video, ads shows tiktok lol",
    "Even China themselves banned Tik Tok nationwide.",
    "Since when US is so afraid of the authoritarian, genocidal, freedomless state of China?  Ain't it suppose to dissolve by itself since it's so EVIL? It seems like if China doesn't exist, the politicians have NOTHING to talk about, every single day,  China this China that...",
    "Lol yeah that will fix the problems with the propaganda flowing through the main stream media. So what about you tube and kick.",
    "NOOOOOOOO",
    "It's ironic how Tiktok is from China, a country with almost no free speech claims their free speech is being taken.",
    "India was way ahead of America in knowing the chinese app threats 😂😂😂",
    "Social media Gives us this imaginary lifestyle and world In general it’s not natural it’s so unhealthy forcing a certain view on life through social media and they don’t even realize it",
    "LOVE THISSS YES TIKTOK CAN STOP FINALLY BRAINWASHING KIDS ❤❤❤❤❤❤❤❤❤❤",
    "Everything something speak up beyond American mindset of corruption will be banned quickly",
    "Clout vs. national security. Really people??",
    "Our country will be in better shape if TikTok is banned. Period. End of story",
    "I wish philippines also ban tiktok",
    "So we China now ????",
    "Here go the media looking to control you, non of that information will do u any harm. U can create a new email & ur location is already shared thru your cell phone… this is about tik tok exposing corrupt government and law enforcement on a high capacity rate",
    "This is the perfect opportunity to bring Vine back",
    "While china banned Facebook",
    "Now we need twitter gone",
    "😅😅迟钝的国家",
    "Ban on tik tok is best idea. Believe me. It has been banned in 🇮🇳 since Covid and positive effects after the ban have been huge. So be happy and support for ban .",
    "SHAME ON YOU USA !!",
    "Yes china is spying high intelligence with tiktoc LOL!  How about all the chinese iPhones americans love? Should iPhones be banned too?",
    "Most people who uses tiktok has mental issues they need to cope with. TikTok will worsen your brain on purpose. It will shorten your attention span. It's a weapon by the Chinese.",
    "I'M 21 BUT PLEASE BAN IT IM BEGGING YOU",
    "Ban it! Not only is it an information gathering tool for China, but the app is destroying our young kids and making idiots out of them. These “challenges” are hurting people and causing mayhem.",
    "BAN IT. PLEASE.",
    "BAN it.",
    "I’d like to see the SAME suggestions for protection of privacy from Instagram, Facebook, Youtube, etc. China saw this bullcrap over a decade ago when they blocked Facebook and they were heavily criticized for trying to protect themselves. North American hypocrisy is hilarious. I don’t see reports warning you of your Alexas and Siris and Google phones that have been recording everything you are doing for years.",
    "#bantiktok",
    "I’m happy and I’m literally 12",
    "God lets hope so",
    "America stop your drama, you will end up isolated and in complete misery.",
    "“Good riddance.” -William Shakespeare.",
    "Tiktok isn't going to be banned is not a threat just using that reason to banned is not going anywhere because people constitution right to have and watch It i aint worried Joe Biden banned nothing take week to find his pen",
    "China tiktok x us twitter YouTube google chrome Facebook covid19 2019 2023 war",
    "China Ban Youtube, Facebook, Twitter = US: China No freedom\r\nUS Ban DJI, Tiktok, Huawei, C919 Plane, Aaerospace, Wechat, Chipset = US: security issue \n\nChina: Everything communist do = US ban.",
    "If you notice tiktokers have a certain characteristic. Narcissistic and full of themselves. Dont trust anyone who uses the app.",
    "Just ban it real quick. If China goes to war with us just for this app, then we know that they were serious and they were trying to steal our information.",
    "Even if they did such a thing, I bet they would only use that for sending ads for other products across the world(ads)\n\nOnly ban it on GOVERNMENT devices…not civilian devices",
    "Idk why people are panicking over this. There are SOOO many alternatives to Tik Tok that don't have a national security threat.",
    "Ok Boomers. You do that and you waive all rights to ever talk about US being the land of freedom.",
    "0:30 you SHOULD care that you’re sharing your information with China. That is terrifying to many people.",
    "Just ban it already. \n#bantiktok",
    "About fkn time",
    "Good riddance I say",
    "Tiktok is horrible ban it please",
    "This is good any gen z are against this get over it",
    "Like, like, like",
    "Americans don’t care about US government spying on them so why would they care about China spying on them?",
    "I remember when furbies were supposedly spying on us.",
    "Good I have TikTok and I’m excited remove it",
    "China already knows everything that goes on in the United States 😂😂😂😂😂 one thing about our government is most of them are not qualified for there jobs😂😂😂😂😂",
    "NOOOO if they do I'll actually start bawling how will I watch my silly little videos now 😢😢😢😢",
    "Kids America is already damaged from TikTok America is already damaged by allowing guns into the wrong hands no law going to change that there are already 1,000,000 + in america making reforming law ain't going to help",
    "This is great to show how mentally people who uses TikTok, even my sister uses TikTok. Trump did say he'll ban TikTok in 2020, but lost election by BiDEn.",
    "TIKTOK 😝🇨🇳",
    "ban it please!",
    "Hypocrite china is afraid to use western apps like google on ALL devices, but is concerned and mocking the west on banning tik tok only on govt mobile devices. Hilarious. Shut up china...oh, and stop lecturing other countries on what they should do with their devices.",
    "Ban it. Someone will have the same crap out in a year or it might already be out, like youtube shorts. Honestly everything collects data nowadays... China banned Facebook for same reason.",
    "Good. Ban and Censor! The US finally realised that the Chinese gov was doing the right thing.",
    "How dumb the avg person is.",
    "JUST ANOTHER WAY TO STEAL OUR INFORMATION \nMEANWHILE WE'RE PLAYING GAMES WHILE THERE STEALING BEHIND THE SCENES!\nSNEAKY RATS",
    "Delete Facebook, Youtube, Instagram too.\nThey stole and use the same video format from TikTok",
    "Taco Bell got mad Expensive",
    "TIKTOK AND CHINA ARE AN IMMEDIATE THREAT!!! The old regime in the Chinese government hates America and democracy and feels we have turned their youth against them. So they created TikTok and are using it to poison the minds of children, trolls are reaching out encouraging kids to hide contact from their parents, and pushing idolization of Nazi propaganda like it's the next \"rebellious cool thing\" and encouraging children to disobey parents and other authority figures with idea that nothing will happen to them because they are kids and look what has been happening with the very young kids across America. Be warned parents. It's already happened to our kid, and probably yours too if you've been having crazy behavioral problems lately.",
    "Biden fail administration of USA 🖐️🤪",
    "I never liked tiktok at all its a Digusting app all its doing is making these teens do stupid and dangerous challenges this is why tiktok needs to be banned permanently from the USA immediately I've had friends who got killed doing dumb challenges and other stuff they shouldn't be doing at all especially the lick challenge that was pathetic and useless and the pink sauce ugh and the Kia challenge too I'm so over tiktok I've lost friends because of that stupid app itself",
    "I'm an American and on the left, and somehow I still understand freedom enough not to be on Tik Tok. What is wrong with people, just handing over their freedom to this nightmare dark empire of 1984 come to life. Look what the CCP has done to Hong Kong AND Burma AND Korea and what they want to do to Taiwan. They just want to steal just like the Russians. Wake up. Stop being such victims of your own empty souls, begging for attention at any price. Get some talent and do something ORIGINAL, not just lipsynching. What a waste of a generation.",
    "How dare you try and take away cute bl videos. At least there’s YouTube shorts",
    "this is so laame\nevery social media collects our data, its just becasue tiktotk is taking too much of facebooks money",
    "Get rid of it and facebook too",
    "The US Goverment and they Socail Media Apps are also they most Evil Organisation of the World.",
    "Pls be banned it killed my sister so it means a lot to me",
    "Freedom of speech is a joke😂 Good for you America",
    "Trump wanted to ban Tic Tok as soon possible.... Media decried him, threw him of Twitter and Facebook.",
    "usa doing the same with facebook instagram twitter google youtube that's hypocrisy",
    "Crap that's called censoring they baning tiktok because they can't control it lol",
    "Facebook, IG, Google, Youtube & every single app & website has already been collecting & selling our data for years! You think China doesn’t already have it?😂",
    "U.S. must and need ban all China app before too late. China CCP always using their huge internet army(50 cents) agents transfer their value(brain wash) to the world.",
    "Just ban it already",
    "Clickbait headline just to get some view slike usually with mainstream news outlets. TikTok is only being banned from use on FEDERAL devices, not in general.",
    "Yeah so what about tourists going America who have tiktok on their phones and coming from countries who allow the use of the App will they be forced to remove the App before entry, this is no more than paranoia forming in a police state, so much for your right to freedom there.",
    "Pls ban talking ginger that app spy’s on kids",
    "0:29 The Great Firewall of China has blocked many sites including Google and YouTube for a long time. TikTok is nothing but a way for an authoritarian regime to manipulate young people around the world. And it is working well: \"I don't care\" The Worst Generation",
    "How many China uncensored fans know this is a good thing.",
    "when the US becomes a communist authoritarian regime ;)",
    "TikTok made me insecure and joining a cult, so yeah ban it",
    "I am the most exciting man on earth",
    "Literally every American social media app is banned in China. They are laughing at us and how easy we make it for them.",
    "That girl is a moron.",
    "They are trying to build a pathway of information from people. Some might not understand the severity of this it's huge.",
    "That’s why trump want to ban tiktok",
    "Bann tiktok ads on youtube no more ads",
    "This is just the beginning.The United States will discover in the future that there has been some things going on with the gaming industry.This will be called the PlayStation conspiracy.If you will recall some years past that there was a news report about how powerful the microprocessors were.I know this is hard to conceive.Your brain is like a computer.Your eyes are like a camera.Can you see were I am going with this.Thank you.Horus Sky God.",
    "To much is going  on   all this nonce is just driving people more and more crazy",
    "What benefit does tik tok have???",
    "Thank God!!!!",
    "Ban Twitter and Facebook while you're at it.",
    "It should be banned, just for Americans mental health. But add in the fact that China is collecting data, it needs to go. Zoomers will have to find another way to fill the black void of narcissism.",
    "Idk why people are so panicked about this, i think its actually good! Anyways there’s gonna be another person or group of people that will make the same thing again",
    "Nooo",
    "Just in: republicans score petty revenge points for the disruption of their Tulsa rally at the BOK Arena.",
    "freedom of speech, democracy. The US government is jealous because only they can monitor European politics and collect user data in Europe and around the world. WhatsApp and Instagram have been transferring user data to the US authorities for a long time!",
    "What about FB, Twitter etc...",
    "0:29 Society is so screwed. After hearing this girl say this, just makes me want to bang my head against the wall so hard. Like how stupid can you be. So she is okay with giving personal information away to China. So clearly this girl doesn’t care about our rights and freedoms here in the United States. China are communists who want global domination. They are a dictatorship. There is no freedom over there. There is no free speech, none of that. She should just move to China then. Like seriously. Wow! It scares me how stupid people can be. Like this is what society has come to. We are so obsessed with these social media apps, that we worship them with our lives. We can’t live without them.",
    "very nice. tiktok is cringe, total waste of time",
    "China makes money off of dumb americans.",
    "China is making Americans dumber with tiktok. Tiktok in China is not even the same in the USA. Because they won't allow that type of trash to their own citizens.  US needs to banned tiktok ASAP.",
    "Young children and young’s don’t need to be in TikTok. This is more distraction and manipulation behavior.",
    "you 18 years old you don’t know nothing about life and security. This is your country is trying to protect you.",
    "i have been waiting for this to happen for SO LONGGG!! PLEASE DONT GET OUR HOPES UP FOR NOTHING… please GO THROUGH WITH GETTING RID OF IT ALL \n\nDo to social media what they did to big tobacco",
    "TikTok is banned in China, along with FB, Google, YouTube and many others. Give the Chinese communist government a taste of their own medicine!",
    "It's sad 😔 being a hater of tic tok 😆 🤣",
    "When trump wanted to ban Tik Tok the media had their swords out for him hmmm",
    "India banned it already",
    "I think all social media should be banned, but that's never going to happen. You can't protect stupid people from themselves.",
    "Chinese version: douyin, shows actual good content like science experiments, mathematics, etc, US? Thirsty asf videos, Stupid dances, and life threatening challenges, this shows that China is trying to make us dumber, to complete its world domination",
    "Does this young lady know how dumb she sounds..... I mean she has to have more brains then what she said here. They are collecting your data in chaina to control the American  people hello.... its a communist country .why don't you just hand over your bank Information your social security  number and everything  else. they can actually  get into your email and anything else you have on line ...... think before you speak",
    "They’re afraid of TT because it can organize and motivate kids to vote.",
    "Made in china",
    "There will be an amawrican version of tiktok with in a year if they ban it",
    "I mean it should. It’s literally Chinese spyware.",
    "Please ban it please 😂",
    "I support a tik tok ban from our country. ❤",
    "Cant we just make a western app that does pretty much the same thing as TikTok and start using that instead? Thats what the. chinese do.",
    "Let's hope so",
    "Nice 🎉🎉",
    "All social media should be banned. It has allowed same minded freaks like Trump voters a way to connect and spread their mental illness.",
    "Please take this app away I beg you",
    "Streisand effect, I never used TikTok until Trump talked about banning it.  Now it is my favorite social media app.",
    "It's about time",
    "There’s a reason why China is dead set on keeping US customers. Wake up people",
    "I hope so",
    "Get rid of  it  asap",
    "no more tic tok ? https://youtu.be/rTc-8h4DvZM",
    "CHINA CAN ALSO BAN ALL AMERICAN COMPANIES DOING BUSINESS IN CHINA. TESLA GM, MC DONALDS , US FINANCIAL SERVICES AND MANY MORE. AMERICAN  SEMICONDUCTOR  SECTOR IS LOOSING BILLIONS DUE TO THE CHINA TEC BAN. YOU CAN GO AHEAD AND DECOUPLE BUT ARE YOU GOING TO BE WILLING TO PAY 3 K FOR YOUR NEXT I PHONE? WHAT HAPPENS WHEN WALL MART CLOSES? CHINA IS THE WORLDS LARGEST CHIP MARKET AND THE WORLDS LARGEST RISING MIDDLE CLASS. 4 X OUR SIZE. TOUGH TALK IS CHAP THE REALITY OF DECOUPLING FROM CHINA WILL BE DEVASTATING TO THE U.S ECONOMY.",
    "Ban it.",
    "0:34\n\nOne of the reasons TikTok should be banned",
    "Please make this happen. TikTok needs to go. TikTok is a virus in today’s society. It needs to go.",
    "no social media should be on government devices",
    "Absolutely,  China banned FB, YouTube and Google. Why not ban Tiktok in US.",
    "I agree with discouraging the use of TikTok, but I don't believe a ban is appropriate. I think instead that we should explore routes by which we can better regulate the sharing of personal data within apps. Give the users the ability to explicitly choose what data to share and not share as they contemplate application use.",
    "\"I'm 18. Look, let me share my information with China if I want to.\"  This is what happens when we fail to teach our young people about history and global politics. TikTok should be banned because it's obvious it exists only to fool people into thinking China can be trusted.",
    "...I am very happy I never signed on with Tiktok at all.",
    "please ban it",
    "Facebook and google do the same",
    "This is alll a ruse, they dont want us talking. TIK TOK is a way we share information quickly and they hate it. The control is slipping, the grip is tightening.",
    "yes, please get rid of it asap",
    "TikTok needs to go. The effect it has had on so many people has been so toxic. Not to mention the detrimental effect it has had on attention spans. Legally, it is a bit uncomfortable, but I would love to see it gone.\n\nIf you are so concerned, why no use one of TikTok's many competitors, like YouTube Shorts or Instagram Reels?",
    "Think why China bans Facebook, YouTube, Google, Twitter, Snapchat, + other American social media in CHINA!!??",
    "look at that dumb Texan so willing to share personal data to China...",
    "It MAY be the world's most popular app today, but...look at the kids today....its a stupid app watched by stupid ppl",
    "Keep TikTok legal if China Coomunist Party acknowledges it's crime against Chinese people at Tiananmen Square.",
    "spytok LOL",
    "TikTok is banned in China.  Hilarious that they oppose efforts to ban it in the US.",
    "Congress authorized Iraq invasion bipartisanly. So what? No WMD found there.",
    "You mean finally a decision by this current administration that would make a positive difference?!",
    "YESSSS!!! PLEASSSSEEE!!",
    "Just ban it. I don't support that app at all.",
    "Please end tiktok",
    "Tick Tock, TikTok",
    "Pass a law so that China can only have tiktok in the USA if they allow FB IG and YT in mainland China. Call it the anti hypocrisy act.",
    "Oh, no... How will I get my daily dose of 'fat acceptance' and 'gender offended' videos?",
    "Just have apple or android ban it . Then people can't say nothing about it",
    "I hope so",
    "Oh no!  What will all the tiktards do???",
    "China banned YouTube so it's nothing wrong with banning TikTok if it concerns personal information and breach security protocols‼️ Or is it also political⁉️🤔"
]